site.org
#+title: Random bits and pieces
#+subtitle: ...about programming, languages, tools, FLOSS software...
#+author: Igor Dejanović
#+hugo_base_dir: .
#+hugo_section: /
#+options: creator:t author:nil

* Interviews
:PROPERTIES:
:EXPORT_FILE_NAME: interviews
:EXPORT_HUGO_SECTION: /
:EXPORT_HUGO_MENU: :menu main
:END:
- In this episode of [[https://www.pythonpodcast.com/][Python.__init__ podcast]] recorded on June 2020, I'm speaking
  with [[https://twitter.com/TobiasMacey][Tobias Macey]] about building DSLs and parsers in Python using [[http://textx.github.io/textX/][textX]].

  - [[https://www.pythonpodcast.com/textx-domain-specific-language-episode-269/][Build Your Own Domain Specific Language in Python With textX - Episode 269]]

- In this episode of [[https://beyondparsing.com/][Beyond Parsing podcast]] recorded on April 2020, I'm speaking
  with [[http://tomassetti.me/][Federico Tomassetti]] and [[https://specificlanguages.com/][Sergej Koščejev]] about my experiences in teaching
  DSLs, introducing DSLs into companies and the business values of DSLs.

  - [[https://beyondparsing.com/interview-with-igor-dejanovic/][Beyond Parsing: Interview with Igor Dejanović]]

