content/interviews.md
+++
title = "Interviews"
draft = false
creator = "Emacs 28.2 (Org mode 9.6 + ox-hugo)"
[menu]
  [menu.main]
    weight = 1006
    identifier = "interviews"
+++

-   In this episode of [Python.\__init\_\_ podcast](https://www.pythonpodcast.com/) recorded on June 2020, I'm speaking
    with [Tobias Macey](https://twitter.com/TobiasMacey) about building DSLs and parsers in Python using [textX](http://textx.github.io/textX/).
    -   [Build Your Own Domain Specific Language in Python With textX - Episode 269](https://www.pythonpodcast.com/textx-domain-specific-language-episode-269/)

-   In this episode of [Beyond Parsing podcast](https://beyondparsing.com/) recorded on April 2020, I'm speaking
    with [Federico Tomassetti](http://tomassetti.me/) and [Sergej Koščejev](https://specificlanguages.com/) about my experiences in teaching
    DSLs, introducing DSLs into companies and the business values of DSLs.
    -   [Beyond Parsing: Interview with Igor Dejanović](https://beyondparsing.com/interview-with-igor-dejanovic/)
